/*! \mainpage notitle
 *
 * \section intro_sec О приложении
 *
 * ##Приложение позволяет воспроизводить 3D модель файлов с разрешением .obj
 *
 * Функционал программы включает:
 * - Перемещение модели по осям X, Y, Z
 * - Поворот модели по осям X, Y, Z
 * - Увеличение и уменьшение масштаба
 * - Позволяет отображать модель в параллельной и центральной проекции
 * - Пользовательское изменение цвета фона
 * - Пользовательское изменение типа (сплошная или пунктирная), цвета и толщины линий
 * - Пользовательское изменение типа (круглые или квадратные), цвета и размера точек
 * - Сохранение и загрузку настроек модели
 * - Сохранение файлов в формате JPEG и BMPб а также запись и созранение небольших "скринкастов" - текущие пользовательские аффинные преобразования загруженного объекта в gif-анимацию
 */
